** Capture
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c c") 'org-capture)
(setq org-capture-templates '
      (

       ("j" "Journal Entry"
	entry (file+datetree "~/Dropbox/OrgFiles/journal.org.gpg")
	"* Event: %?\n\n  %i\n\n "A :prepend t 
	:empty-lines 1)
       ("b" "bi0s Entry"
	entry (file+datetree "~/Dropbox/bi0s/bi0s.org")
	"* Report : %?\n\n  %i\n\n" :prepend t )
       ("t" "Todo" entry (file+headline "~/Dropbox/OrgFiles/gtd/gtd.org" "Tasks")
	"* TODO  %? \nEntered on %t" :prepend t )
       ("T" "Tickler" entry (file+headline "~/Dropbox/OrgFiles/gtd/tickler.org" "Tasks")
	"* %i%? \n %U ")
       ("n" "Notes" entry (file+weektree "~/Dropbox/OrgFiles/note.org")
	"* %?  \n Entered on %t")
       ))
#+END_SRC

#+RESULTS:
| j | Journal Entry | entry | (file+datetree ~/Dropbox/OrgFiles/journal.org.gpg) | * Event: %? |

*** Setting
#+BEGIN_SRC emacs-lisp
  (setq python-shell-interpreter "ipython3"
        python-shell-interpreter-args " -i")


#+END_SRC

#+RESULTS:
:  -i

When Using Ipython using arrow to get the previous history does not work
this can be solved by 
#+BEGIN_SRC emacs-lisp
(eval-after-load 'comint
  '(progn
     ;; originally on C-c M-r and C-c M-s
     (define-key comint-mode-map (kbd "M-p") #'comint-previous-matching-input-from-input)
     (define-key comint-mode-map (kbd "M-n") #'comint-next-matching-input-from-input)
     ;; originally on M-p and M-n
     (define-key comint-mode-map (kbd "C-c M-r") #'comint-previous-input)
     (define-key comint-mode-map (kbd "C-c M-s") #'comint-next-input)))

#+END_SRC

